const message = `
To my bestiee เริ่มจากม.3เลยละกันนะะะ เอาจริงๆคือกุแทบจะจำไม่ได้ด้วยซ้ำว่าเราเริ่มคุยกันยังไง กุจำได้แค่ว่ากุสนุกมากๆแบบทุกครั้งที่กุอยู่กับมึงถึงปีนั้นจะมอมไปหน่อยแบบกุไม่ได้เรียนเลยยค_ึ_ค_ค แต่ทุกๆวันสนุกแล้วก็ผ่านไปไวมาก กุอาจจะทำอะไรเหี้ยไปบ้างแบบตอนนั้นกุเด็กมาก อาจจะเป็นปีที่ไม่มีอะไรเลยแบบว่าเล่นเกมไปวันๆแต่ก็เป็นปีที่ดีที่สุดของกุเหมือนกันน คิดถึงทุกช่วงเวลามากๆๆ ส่วนตอนม.4ก็เราไม่ได้อยู่ห้องเดียวกันก้เลยอาจจะคุยกันน้อยลง แบบกุก็เริ่มทำกิจกรรมเยอะขึ้นด้วยแหละะ แต่คือกุก็อยากบอกว่ามึงเป็นคนที่แบบทำให้กุกล้าทำอะไรหลายๆอย่างจริงๆ แบบขอบคุณที่คู่กับกุตอนค่ายม.4 เหมือนกัน ทุกวันมอมๆ แต่ก็สนุกดีเหมือนกันน ม.5กุแบบดีใจมาที่ได้อยู่ห้องเดียวกับมึง ถึงเราอาจจะคุยกันน้อยลงแบบเยอะอยู่่ คือเราก็มีเพื่อนคนอื่น แต่ก็รักมึงที่สุดเหมือนเดิมม ดีใจที่มีมึงนั่งข้างๆทั้งปี ได้เจอกันทุกๆวัน แอบเล่นเกมกันบ้างฟินๆ แล้วก็มึงเป็นคนที่กุคุยได้ทุกเรื่องแบบจริงๆ ขอบคุณเสมอที่อยู่กับกุ ถ้าไม่มีมึงเล่นเกมด้วยกันกุก็คงเล่นเกมไม่สนุกเหมือนเดิมแล้วว🥲 แบบสุดท้ายทุกช่วงเวลาที่ได้อยู่กับมึงเป็นอะไรที่ทำให้มัธยมของกุเป็นอะไรที่กุจะคิดถึงตลอดไป แบบกุไม่ได้จินตนาการถึงโรงเรียนที่ไม่มีมึงด้วยซ้ำใจหายมากก แบบเวลาโคตรจะผ่านไปเร็วถึงกุจะอยากกลับไปวันที่จะได้เจอมึงในห้องทุกเช้าไม่ได้แล้วมันก็จะไม่มีทางเกิดขึ้นอีกแล้วแต่กุจะไม่มีทางลืมแน่นอนน แต่กุเชื่อว่ามึงจะทำได้ดีในทุกๆอย่างที่มึงเลือกอยู่แล้วว เก่งมากๆเลยย ก็แบบขอบคุณที่เป็นความทรงจำที่ดีของกุนะะ เราอาจจะไม่ได้ปัจฉิมพร้อมกัน แต่มัธยมสำหรับกุมึงจะเป็นคนแรกที่กุนึกถึงเสมอนะะ เสียดายนิดหน่อยที่เราไม่ได้ใช้เวลากันมากกว่านี้ แต่ถึงกุจะจบแล้วก็รักเหมือนเดิมมไว้ไปเที่ยวด้วยกันอีก รักเสมอเลยนะะะ ทักมาหากุได้ตลอดได้ทุกเรื่องพร้อมตอบเสมออ 
`;

let i = 0;
const speed = 40;
const textElement = document.getElementById("text");

function typeWriter(){
  if(i < message.length){
    textElement.innerHTML += message.charAt(i);
    i++;
    setTimeout(typeWriter, speed);
  }
}

typeWriter();

const container = document.getElementById("petals-container");

function createPetal(){

  const petal = document.createElement("img");

  petal.src = "immage/petal.png";
  petal.classList.add("petal");

  // random position
  petal.style.left = Math.random() * window.innerWidth + "px";

  // random size
  const size = 20 + Math.random()*25;
  petal.style.width = size + "px";

  // random speed
  const duration = 6 + Math.random()*6;
  petal.style.animationDuration = duration + "s";

  container.appendChild(petal);

  // remove after fall
  setTimeout(()=>{
    petal.remove();
  }, duration*1000);
}

/* create petals continuously */
setInterval(createPetal, 500);